export const mockPrograms = [
  {
    id: 1,
    university: "Витебский Государственный Университет",
    shortName: "ВГУ имени П.М. Машерова",
    faculty: "Факультет Математики и Информационных технологий (ФМИТ)",
    title: "Программная инженерия",
    code: "6-05-0612-01",
    budgetScore: 400,
    paidScore: 399,
    city: "Витебск",
    degree: "Бакалавриат",
    studyForm: "Очная",
    duration: "4 года",
    exams: "Математика, Физика, Русский/Белорусский",
    plan: "45 бюджет / 60 платное",
    language: "Русский",
    militaryDepartment: "Есть",
    dormitory: "На весь срок обучения",
    address: "210038, г. Витебск, пр-т Московский, 33",
    phone: "+375 212 37-49-59",
    website: "vsu.by",
    description: `Программа «Программная инженерия» (09.03.04) готовит многопрофильных системных архитекторов и инженеров-программистов, одинаково хорошо владеющих детерминированным алгоритмическим проектированием, программной безопасностью и стохастическими вероятностными моделями. Студенты осваивают крупномасштабные распределенные архитектуры, компиляторы параллельного выполнения, парадигмы граничных вычислений и масштабируемые развертывания глубоких нейронных сетей в критически важных промышленных средах.

На начальных этапах обучения студенты проходят углубленную подготовку по таким фундаментальным дисциплинам, как дискретная математика, архитектура компиляторов и проектирование операционных систем, после чего переходят к освоению специализированных профессиональных направлений: облачная инфраструктура корпоративного уровня, искусственный интеллект и разработка автономных агентов, а также высокопроизводительные вычислительные системы.

Выпускники занимают такие значимые должности, как архитектор систем искусственного интеллекта, старший инженер-программист и специалист по инфраструктуре машинного обучения, обладая при этом глубоким практическим владением современными промышленными программными стеками и навыками применения строгих методов исследований.`,
    scoreHistory: [
      { year: "2020", score: 228 },
      { year: "2021", score: 232 },
      { year: "2022", score: 238 },
      { year: "2023", score: 242 },
      { year: "2024", score: 246 },
      { year: "2025", score: 250 },
      { year: "2026Р", score: 254 },
    ]
  }
];